module.exports = {

  CP_MAX_GREAT: 1500,
  CP_MAX_ULTRA: 2500,

  IV_VALUES: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  PL_VALUES: [
    40.0, 39.5, 39.0, 38.5, 38.0, 37.5, 37.0, 36.5, 36.0, 35.5, 35.0, 34.5, 34.0, 33.5, 33.0,
    32.5, 32.0, 31.5, 31.0, 30.5, 30.0, 29.5, 29.0, 28.5, 28.0, 27.5, 27.0, 26.5, 26.0, 25.5,
    25.0, 24.5, 24.0, 23.5, 23.0, 22.5, 22.0, 21.5, 21.0, 20.5, 20.0, 19.5, 19.0, 18.5, 18.0,
    17.5, 17.0, 16.5, 16.0, 15.5, 15.0, 14.5, 14.0, 13.5, 13.0, 12.5, 12.0, 11.5, 11.0, 10.5,
    10.0, 9.5, 9.0, 8.5, 8.0, 7.5, 7.0, 6.5, 6.0, 5.5, 5.0, 4.5, 4.0, 3.5, 3.0, 2.5, 2.0, 1.5, 1.0,
  ],

  RAID_MIN_STATS: {
    minS: 10,
    minA: 10,
    minD: 10,
    minPL: 20,
  },
  DISCOVERY_MIN_STATS: {
    minS: 10,
    minA: 10,
    minD: 10,
    minPL: 15,
  },
  EGG_MIN_STATS: {
    minS: 10,
    minA: 10,
    minD: 10,
    minPL: 1,
  },

  RAID_POKEMON: [
    'ミュウツー', 'レジロック', 'レジアイス', 'レジスチル', 'ラティアス', 'ラティオス', 'カイオーガ',
    'グラードン', 'レックウザ', 'デオキシス(ノーマルフォルム)', 'デオキシス(アタックフォルム)',
    'ギラティナ(アナザーフォルム)', 'クレセリア', 'ヒードラン', 'クチート', 'アブソル', 'アローラライチュウ',
    'アローラガラガラ', 'デオキシス(アタックフォルム)',
  ],
  DISCOVERY_POKEMON: [
    'フリーザー', 'サンダー', 'ファイヤー', 'ミュウ', 'ライコウ', 'エンテイ', 'スイクン', 'ルギア', 'ホウオウ',
    'セレビィ', 'ヌケニン', 'パッチール', 'ミカルゲ', 'ツチニン',
  ],
  EGG_POKEMON: [
    'ピチュー', 'ピィ', 'ププリン', 'トゲピー', 'バルキー', 'ムチュール', 'エレキッド', 'ブビィ', 'ルリリ',
    'ソーナノ', 'スボミー', 'リオル', 'アローラサンド', 'アローラロコン', 'アローラニャース',
    'アローラベトベター', 'リーシャン', 'ゴンベ', 'タマンタ',
  ],
};
